{
 "cells": [
  {
   "cell_type": "markdown",
   "id": "9a5d3b38-97e7-4ae2-a72d-108aa7c5aa24",
   "metadata": {},
   "source": [
    "# Этап 2: Деанонимизация и графовая кластеризация адресов\n",
    " \n",
    "## Описание файла\n",
    "В данном ноутбуке реализуется математическая модель деанонимизации участников сети Bitcoin на основе теории графов. Из-за отсутствия явных идентификаторов пользователей в блокчейне применяются детерминированные эвристики для объединения разрозненных адресов в единые сущности (Entities).\n",
    "\n",
    "**Реализованные алгоритмы:**\n",
    "1. **Эвристика совместного использования входов (Common Input Ownership):** Поиск компонент связности в неориентированном графе транзакций (с использованием библиотеки `networkx`).\n",
    "2. **Эвристика адреса сдачи (Change Address):** Выявление одноразовых адресов возврата средств, сгенерированных HD-кошельками отправителей.\n",
    "\n",
    "**Цель:** Сократить размерность графа и трансформировать таблицу адресов в таблицу реальных акторов сети.\n",
    "\n",
    "**Входные данные:** `../data/blockchain_dataset.csv`  \n",
    "**Выходные данные:** `../data/blockchain_final_entities.csv`"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 1,
   "id": "8be3405c-f440-49b6-a377-3582812fa520",
   "metadata": {},
   "outputs": [],
   "source": [
    "import pandas as pd\n",
    "\n",
    "def apply_change_heuristic(csv_path):\n",
    "    print(\"1. Загрузка данных с кластерами...\")\n",
    "    df = pd.read_csv(csv_path)\n",
    "    \n",
    "    first_seen = df.groupby('Address')['BlockHeight'].min().to_dict()\n",
    "    tx_groups = df.groupby('TxID')\n",
    "    \n",
    "    change_addresses_found = 0\n",
    "    \n",
    "    print(\"2. Поиск адресов сдачи (Change Addresses)...\")\n",
    "    for txid, tx_data in tx_groups:\n",
    "        inputs = tx_data[tx_data['Type'] == 'INPUT']\n",
    "        outputs = tx_data[tx_data['Type'] == 'OUTPUT']\n",
    "        \n",
    "        if len(outputs) == 2 and len(inputs) > 0:\n",
    "            sender_entity = inputs.iloc[0]['Entity_ID']\n",
    "            \n",
    "            output_addrs = outputs['Address'].tolist()\n",
    "            out_1, out_2 = output_addrs[0], output_addrs[1]\n",
    "            \n",
    "            if out_1 == \"Non-standard\" or out_2 == \"Non-standard\":\n",
    "                continue\n",
    "                \n",
    "            current_block = tx_data['BlockHeight'].iloc[0]\n",
    "            \n",
    "            out_1_is_new = first_seen.get(out_1) == current_block\n",
    "            out_2_is_new = first_seen.get(out_2) == current_block\n",
    "            \n",
    "            change_address = None\n",
    "            \n",
    "            if out_1_is_new and not out_2_is_new:\n",
    "                change_address = out_1\n",
    "            elif out_2_is_new and not out_1_is_new:\n",
    "                change_address = out_2\n",
    "                \n",
    "            if change_address:\n",
    "                old_entity = df.loc[df['Address'] == change_address, 'Entity_ID'].iloc[0]\n",
    "                df.loc[df['Entity_ID'] == old_entity, 'Entity_ID'] = sender_entity\n",
    "                change_addresses_found += 1\n",
    "\n",
    "    print(f\"\\nНайдено и присоединено адресов сдачи: {change_addresses_found}\")\n",
    "    \n",
    "    output_file = \"blockchain_final_entities.csv\"\n",
    "    df.to_csv(output_file, index=False)\n",
    "    print(f\"Готово! Финальные данные сохранены в {output_file}\")\n",
    "    \n",
    "    return df"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 2,
   "id": "0bcde1a6-23f7-48c9-a95e-c4c8b3957a97",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "1. Загрузка данных с кластерами...\n",
      "2. Поиск адресов сдачи (Change Addresses)...\n",
      "\n",
      "Найдено и присоединено адресов сдачи: 82\n",
      "Готово! Финальные данные сохранены в blockchain_final_entities.csv\n",
      "\n",
      "Топ-5 кластеров ПОСЛЕ применения эвристики адреса сдачи:\n",
      "Entity_ID\n",
      "Cluster_21    323\n",
      "Cluster_99     73\n",
      "Cluster_77     33\n",
      "Cluster_15     22\n",
      "Cluster_73     17\n",
      "Name: Address, dtype: int64\n",
      "\n",
      "Всего уникальных сущностей (Entity) осталось: 754\n"
     ]
    }
   ],
   "source": [
    "input_file = \"blockchain_clustered.csv\" \n",
    "\n",
    "df_final = apply_change_heuristic(input_file)\n",
    "\n",
    "print(\"\\nТоп-5 кластеров ПОСЛЕ применения эвристики адреса сдачи:\")\n",
    "cluster_sizes = df_final.groupby('Entity_ID')['Address'].nunique().sort_values(ascending=False)\n",
    "print(cluster_sizes.head())\n",
    "print(f\"\\nВсего уникальных сущностей (Entity) осталось: {df_final['Entity_ID'].nunique()}\")"
   ]
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": "Python [conda env:base] *",
   "language": "python",
   "name": "conda-base-py"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 3
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython3",
   "version": "3.13.5"
  }
 },
 "nbformat": 4,
 "nbformat_minor": 5
}
