{
 "cells": [
  {
   "cell_type": "markdown",
   "id": "6d963bd5-45d5-4026-9142-f59ad8d773b9",
   "metadata": {},
   "source": [
    "# Этап 3: Конструирование признаков (Feature Engineering)\n",
    "\n",
    "## Описание файла\n",
    "Скрипт выполняет профилирование выделенных на предыдущем этапе кластеров (сущностей). Для последующего применения алгоритмов машинного обучения транзакционная история трансформируется в набор числовых поведенческих метрик.\n",
    "\n",
    "**Извлекаемые признаки (Features):**\n",
    "* `Tx_Count` — суммарная транзакционная активность (частота переводов).\n",
    "* `Address_Count` — размер инфраструктуры кошелька (количество адресов).\n",
    "* `Total_Received` / `Total_Sent` — финансовый оборот сущности.\n",
    "* `Balance` — текущий остаток средств (в рамках исследуемого временного окна).\n",
    "\n",
    "**Цель:** Подготовить структурированный датасет для кластеризации поведения (Behavioral Clustering).\n",
    "\n",
    "**Входные данные:** `../data/blockchain_final_entities.csv`  \n",
    "**Выходные данные:** `../data/entity_features.csv`"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 1,
   "id": "087c18be-4bc6-43fa-86d8-c5ff0a6a7c24",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "1. Загрузка финального датасета с кластерами...\n",
      "2. Сбор статистики по каждой сущности...\n",
      "3. Объединение досье в единую таблицу...\n",
      "4. Сохранение признаков (Features)...\n",
      "Готово! Досье сохранены в entity_features.csv\n",
      "\n",
      "Топ-5 самых активных сущностей (потенциальные биржи/сервисы):\n",
      "      Entity_ID  Tx_Count  Address_Count  Total_Received   Total_Sent  \\\n",
      "753  Cluster_99       382             73     1532.480598  1530.953268   \n",
      "743   Cluster_9        78              1        1.458251     1.433140   \n",
      "46   Cluster_14        38              1        0.829862     1.162296   \n",
      "221   Cluster_3        31              9       28.990979    32.914631   \n",
      "123  Cluster_21        15            323        1.370012    30.302013   \n",
      "\n",
      "       Balance  \n",
      "753   1.527330  \n",
      "743   0.025112  \n",
      "46   -0.332434  \n",
      "221  -3.923652  \n",
      "123 -28.932001  \n",
      "\n",
      "Всего собрано досье на 754 уникальных сущностей.\n"
     ]
    }
   ],
   "source": [
    "import pandas as pd\n",
    "import numpy as np\n",
    "\n",
    "def build_entity_features(csv_path):\n",
    "    print(\"1. Загрузка финального датасета с кластерами...\")\n",
    "    df = pd.read_csv(csv_path)\n",
    "\n",
    "    df = df.dropna(subset=['Entity_ID'])\n",
    "    \n",
    "    print(\"2. Сбор статистики по каждой сущности...\")\n",
    "    \n",
    "    received = df[df['Type'] == 'OUTPUT'].groupby('Entity_ID')['Amount_BTC'].sum().reset_index()\n",
    "    received.columns = ['Entity_ID', 'Total_Received']\n",
    "    \n",
    "    sent = df[df['Type'] == 'INPUT'].groupby('Entity_ID')['Amount_BTC'].sum().reset_index()\n",
    "    sent.columns = ['Entity_ID', 'Total_Sent']\n",
    "    \n",
    "    tx_counts = df.groupby('Entity_ID')['TxID'].nunique().reset_index()\n",
    "    tx_counts.columns = ['Entity_ID', 'Tx_Count']\n",
    "    \n",
    "    addr_counts = df.groupby('Entity_ID')['Address'].nunique().reset_index()\n",
    "    addr_counts.columns = ['Entity_ID', 'Address_Count']\n",
    "    \n",
    "    print(\"3. Объединение досье в единую таблицу...\")\n",
    "    features_df = tx_counts.merge(addr_counts, on='Entity_ID', how='outer')\n",
    "    features_df = features_df.merge(received, on='Entity_ID', how='left')\n",
    "    features_df = features_df.merge(sent, on='Entity_ID', how='left')\n",
    "    \n",
    "    features_df = features_df.fillna(0)\n",
    "    \n",
    "    features_df['Balance'] = features_df['Total_Received'] - features_df['Total_Sent']\n",
    "    \n",
    "    features_df = features_df.sort_values(by='Tx_Count', ascending=False)\n",
    "    \n",
    "    print(\"4. Сохранение признаков (Features)...\")\n",
    "    output_file = \"entity_features.csv\" \n",
    "    features_df.to_csv(output_file, index=False)\n",
    "    print(f\"Готово! Досье сохранены в {output_file}\")\n",
    "    \n",
    "    return features_df\n",
    "\n",
    "if __name__ == \"__main__\":\n",
    "    \n",
    "    input_file = \"blockchain_final_entities.csv\" \n",
    "    \n",
    "    df_features = build_entity_features(input_file)\n",
    "    \n",
    "    print(\"\\nТоп-5 самых активных сущностей (потенциальные биржи/сервисы):\")\n",
    "    print(df_features.head())\n",
    "    \n",
    "    print(f\"\\nВсего собрано досье на {len(df_features)} уникальных сущностей.\")"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "a6575cc0-fcc0-46d4-b5a6-098d3653ea26",
   "metadata": {},
   "outputs": [],
   "source": []
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": "Python [conda env:base] *",
   "language": "python",
   "name": "conda-base-py"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 3
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython3",
   "version": "3.13.5"
  }
 },
 "nbformat": 4,
 "nbformat_minor": 5
}
